![[Pasted image 20251017113112.png]]
![[Pasted image 20251017120441.png]]
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 71
Switch(config-vlan)#name Directors
Switch(config-vlan)#ex
Switch(config)#vlan 77
Switch(config-vlan)#name Zam
Switch(config-vlan)#ex
Switch(config)#vlan 112
Switch(config-vlan)#name Secretary
Switch(config-vlan)#ex
Switch(config)#
*Oct 17 09:03:19.437: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#ex
% Ambiguous command:  "ex"
PiterSW1_ACS(config)#exit
PiterSW1_ACS#wr
*Oct 17 09:04:07.452: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#wr memory
Building configuration...
Compressed configuration from 883 bytes to 583 bytes[OK]
PiterSW1_ACS#
