![[Pasted image 20251017130101.png]]
![[Pasted image 20251017120441.png]]
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 71
Switch(config-vlan)#name Directors
Switch(config-vlan)#ex
Switch(config)#vlan 77
Switch(config-vlan)#name Zam
Switch(config-vlan)#ex
Switch(config)#vlan 112
Switch(config-vlan)#name Secretary
Switch(config-vlan)#ex
Switch(config)#
*Oct 17 09:03:19.437: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#ex
% Ambiguous command:  "ex"
PiterSW1_ACS(config)#exit
PiterSW1_ACS#wr
*Oct 17 09:04:07.452: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#wr memory
Building configuration...
Compressed configuration from 883 bytes to 583 bytes[OK]
PiterSW1_ACS#
![[Pasted image 20251017121057.png]]
Switch>en
Switch#hostname PiterSW1_Core
        ^
% Invalid input detected at '^' marker.

Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_Core
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Directors
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name Secretary
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name NATIVE
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 17 09:09:50.015: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#wr memory
Building configuration...
Compressed configuration from 884 bytes to 584 bytes[OK]
PiterSW1_Core#
*Oct 17 09:10:08.210: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_Core#
![[Pasted image 20251017122149.png]]
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#namehost PiterSW2_ACS
                ^
% Invalid input detected at '^' marker.

Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Directors
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name Secretary
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr m
*Oct 17 09:20:57.653: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name NATIVE
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr
*Oct 17 09:21:20.561: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#wr memory
Building configuration...
Compressed configuration from 883 bytes to 584 bytes[OK]
PiterSW2_ACS#
![[Pasted image 20251017123001.png]]
![[Pasted image 20251017123840.png]]
![[Pasted image 20251017124259.png]]
![[Pasted image 20251017124706.png]]
PiterSW1_ACS>en
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface e0/2
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 71
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#interface e0/3
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 112
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#wr
*Oct 17 10:04:19.649: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#wr memory
![[Pasted image 20251017130627.png]]
![[Pasted image 20251017131944.png]]
![[Pasted image 20251017131957.png]]
PiterSW2_ACS(config)#interface e0/1
PiterSW2_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW2_ACS(config-if)#switchport mode trunk
PiterSW2_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_ACS(config-if)#switchport trunk native vlan 999
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#
*Oct 17 10:25:23.227: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW2_Core Ethernet0/3 (1).
PiterSW2_ACS(config)#
*Oct 17 10:26:18.600: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW2_Core Ethernet0/3 (1).
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr
*Oct 17 10:26:50.289: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#wr memory
Building configuration...
Compressed configuration from 1194 bytes to 743 bytes[OK]
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface range e0/1
PiterSW1_ACS(config-if-range)#switchport trunk encapsulation dot1q
PiterSW1_ACS(config-if-range)#switchport mode trunk
PiterSW1_ACS(config-if-range)#switchport trunk allowed vlan 71,77,112
PiterSW1_ACS(config-if-range)#switchport trunk native vlan 999
PiterSW1_ACS(config-if-range)#switchport nonegotiate
PiterSW1_ACS(config-if-range)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 17 10:28:49.224: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#
*Oct 17 10:28:51.872: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW1_Core Ethernet0/3 (1).
PiterSW1_ACS#wr memory
Building configuration...
Compressed configuration from 1194 bytes to 743 bytes[OK]
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#interface e0/3
PiterSW1_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if)#switchport mode trunk
PiterSW1_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if)#switchport trunk native vlan 999
PiterSW1_Core(config-if)#switchport nonegotiate
PiterSW1_Core(config-if)#exit
PiterSW1_Core(config)#exit
PiterSW1_Core#wr
*Oct 17 10:30:21.596: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#wr memory
Building configuration...
Compressed configuration from 1044 bytes to 683 bytes[OK]
PiterSW2_Core>en
PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#interface e0/3
PiterSW2_Core(config-if)#
*Oct 17 10:31:01.537: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/3 (1), with PiterSW2_ACS Ethernet0/1 (999).
PiterSW2_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if)#switchport mode trunk
PiterSW2_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if)#switchport trunk native vlan 999
PiterSW2_Core(config-if)#switchport nonegotiate
PiterSW2_Core(config-if)#exit
PiterSW2_Core(config)#exit
PiterSW2_Core#wr
*Oct 17 10:31:31.698: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr memory
Building configuration...
Compressed configuration from 1044 bytes to 683 bytes[OK]


