![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251018193314.png?raw=true>)
Вот схема для лр4
Cтатическая маршрутизация (Питер)
```
Router(config)#hostname Piter_RTR1
Piter_RTR1(config)#int e0/0
Piter_RTR1(config-if)#ip address 172.18.71.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#
*Oct 18 17:40:52.549: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 18 17:40:53.556: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, cha                                                                                                                        nged state to up
Piter_RTR1(config)#int e0/1
Piter_RTR1(config-if)#ip address 172.18.112.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#
*Oct 18 17:41:19.203: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 18 17:41:20.209: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, cha                                                                                                                        nged state to up
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
Piter_RTR1#ping 172.18.112.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.10, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
Piter_RTR1#ping 172.18.112.11
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/13/18 ms
Piter_RTR1#ping 172.18.77.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.77.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 11/14/16 ms
Piter_RTR1#ping 172.18.71.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.71.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 14/15/16 ms

```
Настроил пк vip
![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251019140810.png?raw=true>)
Делаем конфигурацию VLAN и настройку портов коммутатора SW_VIP для подключения к VLAN 777, отключаем неиспользуемые интерфейсы
```
Switch>EN
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW_VIP
SW_VIP(config)#vlan 777
SW_VIP(config-vlan)#name VIP_VLAN
SW_VIP(config-vlan)#ex
SW_VIP(config)#int e0/1
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#ex
SW_VIP(config)#int e0/0
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#exit
SW_VIP(config)#interface range ethernet0/2-3
SW_VIP(config-if-range)#shutdown
SW_VIP(config-if-range)#
*Oct 19 11:21:01.296: %LINK-5-CHANGED: Interface Ethernet0/2, changed state to administratively down
*Oct 19 11:21:01.326: %LINK-5-CHANGED: Interface Ethernet0/3, changed state to administratively down
*Oct 19 11:21:02.302: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
*Oct 19 11:21:02.333: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
SW_VIP(config-if-range)#exit
Настройка IP-адреса на интерфейсе e0/1 маршрутизатора Kzn_RTR2 для маршрутизации
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname Kzn_RTR2
Kzn_RTR2(config)#int e0/1
Kzn_RTR2(config-if)#
*Oct 19 11:23:32.108: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Kzn_RTR2(config-if)#no switchport
                        ^
% Invalid input detected at '^' marker.

Kzn_RTR2(config-if)#ip address 10.10.77.1 255.255.255.0
Kzn_RTR2(config-if)#no shutdown
Kzn_RTR2(config-if)#ex
Kzn_RTR2(config)#
*Oct 19 11:24:00.277: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
Kzn_RTR2(config)#
*Oct 19 11:24:01.298: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
Kzn_RTR2(config)#end
Kzn_RTR2#
*Oct 19 11:24:13.425: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR2#wr memory
Building configuration...
[OK]
```
![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251019142547.png?raw=true>)
Kzn_RTR1 конфигурация OSPF на маршрутизаторе Kzn_RTR1,установка router-id и настройка интерфейсов зоны 0
```
Kzn_RTR1#configure terminal
Kzn_RTR1(config)#hostname Kzn_RTR1
Kzn_RTR1(config)#interface Ethernet0/0
Kzn_RTR1(config-if)#ip address 10.0.1.1 255.255.255.252
Kzn_RTR1(config-if)#no shutdown
Kzn_RTR1(config-if)#ip ospf 1 area 0
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ip ospf priority 255
Kzn_RTR1(config-if)#ip ospf network point-to-point
Kzn_RTR1(config-if)#exit
Kzn_RTR1(config)#interface Ethernet0/1
Kzn_RTR1(config-if)#ip address 10.0.2.1 255.255.255.252
Kzn_RTR1(config-if)#no shutdown
Kzn_RTR1(config-if)#ip ospf 1 area 0
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ip ospf priority 255
Kzn_RTR1(config-if)#ip ospf network point-to-point
Kzn_RTR1(config-if)#exit
Kzn_RTR1(config)#interface Ethernet0/2
Kzn_RTR1(config-if)#ip address 10.0.3.1 255.255.255.252
Kzn_RTR1(config-if)#no shutdown
Kzn_RTR1(config-if)#ip ospf 1 area 0
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ip ospf priority 255
Kzn_RTR1(config-if)#ip ospf network point-to-point
Kzn_RTR1(config-if)#exit
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)#router-id 4.4.4.4
Kzn_RTR1(config-router)#network 10.10.4.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.71.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.84.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.86.0 0.0.0.127 area 0
Kzn_RTR1(config-router)#network 10.10.77.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.84.16 0.0.0.15 area 0
Kzn_RTR1(config-router)#exit
Kzn_RTR1(config)#end
Kzn_RTR1#write memory

```
OSPF настроена и соседства установлены, а аутентификация MD5 применена
Теперь Kzn_RTR2
```
Kzn_RTR2#configure terminal
Kzn_RTR2(config)#interface Ethernet0/0
Kzn_RTR2(config-if)#ip address 10.0.3.2 255.255.255.252
Kzn_RTR2(config-if)#no shutdown
Kzn_RTR2(config-if)#ip ospf 1 area 0
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ip ospf network point-to-point
Kzn_RTR2(config-if)#exit
Kzn_RTR2(config)#interface Ethernet0/1
Kzn_RTR2(config-if)#ip address 10.10.77.1 255.255.255.0
Kzn_RTR2(config-if)#no shutdown
Kzn_RTR2(config-if)#ip ospf 1 area 0
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ip ospf network point-to-point
Kzn_RTR2(config-if)#exit
Kzn_RTR2(config)#router ospf 1
Kzn_RTR2(config-router)#router-id 5.5.5.5
Kzn_RTR2(config-router)#network 10.10.4.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.71.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.84.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.86.0 0.0.0.127 area 0
Kzn_RTR2(config-router)#network 10.10.77.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.84.16 0.0.0.15 area 0
Kzn_RTR2(config-router)#exit
Kzn_RTR2(config)#end
Kzn_RTR2#write memory
```
 У меня вылезали ошибки в  KznSW1-2 core и я принял решения их пересоздать
 ```
KznSW1_Core#configure terminal
KznSW1_Core(config)#interface Ethernet0/3
KznSW1_Core(config-if)#no switchport
KznSW1_Core(config-if)#ip address 10.0.1.2 255.255.255.252
KznSW1_Core(config-if)#no shutdown
KznSW1_Core(config-if)#exit
KznSW1_Core(config)#router ospf 1
KznSW1_Core(config-router)#router-id 3.3.3.3
KznSW1_Core(config-router)#network 0.0.0.0 255.255.255.255 area 0
KznSW1_Core(config-router)#exit
KznSW1_Core(config)#interface Ethernet0/3
KznSW1_Core(config-if)#ip ospf 1 area 0
KznSW1_Core(config-if)#ip ospf message-digest-key 1 md5 PROTECH
KznSW1_Core(config-if)#ip ospf authentication message-digest
KznSW1_Core(config-if)#ip ospf priority 50
KznSW1_Core(config-if)#ip ospf network point-to-point
KznSW1_Core(config-if)#exit
KznSW1_Core(config)#end
KznSW1_Core#write memory

KznSW2_Core#configure terminal
KznSW2_Core(config)#interface Ethernet0/3
KznSW2_Core(config-if)#no switchport
KznSW2_Core(config-if)#ip address 10.0.2.2 255.255.255.252
KznSW2_Core(config-if)#no shutdown
KznSW2_Core(config-if)#exit
KznSW2_Core(config)#router ospf 1
KznSW2_Core(config-router)#router-id 4.4.4.4
KznSW2_Core(config-router)#network 0.0.0.0 255.255.255.255 area 0
KznSW2_Core(config-router)#exit
KznSW2_Core(config)#interface Ethernet0/3
KznSW2_Core(config-if)#ip ospf 1 area 0
KznSW2_Core(config-if)#ip ospf message-digest-key 1 md5 PROTECH
KznSW2_Core(config-if)#ip ospf authentication message-digest
KznSW2_Core(config-if)#ip ospf priority 50
KznSW2_Core(config-if)#ip ospf network point-to-point
KznSW2_Core(config-if)#exit
KznSW2_Core(config)#end
KznSW2_Core#write memory
```
 
![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251019235041.png?raw=true>)
Дальше надо пингануть любой пк в кабинете в казани (у меня всё время не получалось ,и проблема была в том что я не поставил нужный vlan)
 На Switch1_ACS
```
 interface Ethernet1/0
 switchport mode access
 switchport access vlan 86
 no shutdown
```
  На Switch3_DSTR
```
  Switch3_DSTR(config)#interface Ethernet0/3
Switch3_DSTR(config-if)#switchport mode access
Switch3_DSTR(config-if)# switchport access vlan 86
Switch3_DSTR(config-if)# no shutdown
Switch3_DSTR(config-if)#ex
```
и я ещё раз перепроверил свои пк и всё заработало 
![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251020085617.png?raw=true>)
пингую в питере
![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251019224543.png?raw=true>)