![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251021210542.png?raw=true>)
```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname
*Oct 20 19:21:48.009: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Confird)
Switch(config)#hostname RTR
RTR(config)#ip routing
RTR(config)#int e0/0
RTR(config-if)#ip address 10.0.10.1 255.255.255.252
                    ^
% Invalid input detected at '^' marker.

RTR(config-if)#no switchport
RTR(config-if)#
*Oct 20 19:23:55.075: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 20 19:23:56.086: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/nged state to up
RTR(config-if)#ip address 10.0.10.1 255.255.255.252
RTR(config-if)#no shutdown
RTR(config-if)#ex
RTR(config)#interface ethernet0/1
RTR(config-if)#no switchport
RTR(config-if)#
*Oct 20 19:24:25.633: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 20 19:24:26.652: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/nged state to up
RTR(config-if)#ip address 10.0.20.1 255.255.255.252
RTR(config-if)#no shutdown
RTR(config-if)#ex
RTR(config)#interface range ethernet0/2 - 3
RTR(config-if-range)#shutdown
RTR(config-if-range)#ex
RTR(config)#
*Oct 20 19:24:55.394: %LINK-5-CHANGED: Interface Ethernet0/2, changed state to atratively down
*Oct 20 19:24:55.440: %LINK-5-CHANGED: Interface Ethernet0/3, changed state to atratively down
*Oct 20 19:24:56.410: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/nged state to down
*Oct 20 19:24:56.455: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/nged state to down
RTR(config)#router bgp 200
RTR(config-router)#bgp router-id 10.10.10.10
RTR(config-router)# bgp log-neighbor-changes
RTR(config-router)# neighbor 10.0.10.2 remote-as 201
RTR(config-router)# neighbor 10.0.10.2 description Piter_RTR1
RTR(config-router)# neighbor 10.0.10.2 password PROTECH
RTR(config-router)# neighbor 10.0.10.2 next-hop-self
RTR(config-router)# neighbor 10.0.10.2 soft-reconfiguration inbound
RTR(config-router)# neighbor 10.0.20.2 remote-as 202
RTR(config-router)# neighbor 10.0.20.2 description Kzn_RTR1
RTR(config-router)# neighbor 10.0.20.2 password PROTECH
RTR(config-router)# neighbor 10.0.20.2 next-hop-self
RTR(config-router)# neighbor 10.0.20.2 soft-reconfiguration inbound
RTR(config-router)# network 10.0.10.0 mask 255.255.255.252
RTR(config-router)# network 10.0.20.0 mask 255.255.255.252
RTR(config-router)# bgp default local-preference 100
RTR(config-router)#ex
RTR(config)#exit
RTR#
*Oct 20 19:25:38.514: %SYS-5-CONFIG_I: Configured from console by console
RTR#wr memory
Building configuration...
Compressed configuration from 1446 bytes to 889 bytes[OK]
RTR#
*Oct 20 19:27:22.240: %BGP-5-ADJCHANGE: neighbor 10.0.20.2 Up
RTR#
*Oct 20 19:30:31.274: %BGP-5-ADJCHANGE: neighbor 10.0.10.2 Up

```

Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)#neighbor 10.0.0.6 remote-as 200
Piter_RTR1(config-router)#neighbor 10.0.0.6 update-source Ethernet0/2
Piter_RTR1(config-router)#network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)#ex
Piter_RTR1(config)#

```
Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#interface ethernet0/0
Kzn_RTR1(config-if)#ip address 10.0.1.1 255.255.255.252
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/0: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# no shutdown
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#interface ethernet0/1
Kzn_RTR1(config-if)# ip address 10.0.2.1 255.255.255.252
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/1: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# no shutdown
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#interface ethernet0/2
Kzn_RTR1(config-if)# ip address 10.0.3.1 255.255.255.252
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/2: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# no shutdown
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#interface ethernet0/3
Kzn_RTR1(config-if)# ip address 10.0.20.2 255.255.255.252
Kzn_RTR1(config-if)# no shutdown
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#
*Oct 20 19:27:05.810: %LINK-3-UPDOWN: Interface Ethernet0/3, changed state to up
*Oct 20 19:27:06.829: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/nged state to up
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)#bgp router-id 1.1.1.1
Kzn_RTR1(config-router)# bgp log-neighbor-changes
Kzn_RTR1(config-router)# neighbor 10.0.20.1 remote-as 200
Kzn_RTR1(config-router)# neighbor 10.0.20.1 description RTR
Kzn_RTR1(config-router)# neighbor 10.0.20.1 password PROTECH
Kzn_RTR1(config-router)# network 10.0.1.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.0.2.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.0.3.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.77.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)# network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)# redistribute ospf 1
Kzn_RTR1(config-router)#ex
Kzn_RTR1(config)#
*Oct 20 19:27:22.240: %BGP-5-ADJCHANGE: neighbor 10.0.20.1 Up
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)#router-id 1.1.1.1
Kzn_RTR1(config-router)# network 10.0.1.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# network 10.0.2.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# network 10.0.3.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# passive-interface ethernet0/3
Kzn_RTR1(config-router)# redistribute bgp 202 subnets
Kzn_RTR1(config-router)#ex
Kzn_RTR1(config)#exit
Kzn_RTR1#
*Oct 20 19:27:46.363: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR1#wr memory
Building configuration...
[OK]

```

![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251020224140.png?raw=true>)