Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RTR
RTR(config)#router bgp 200
RTR(config-router)#
*Oct 20 06:01:48.028: %BGP-4-NORTRID: BGP could not pick a router-id. Please configure manually.
RTR(config-router)#neighbor 10.0.0.5 remote-as 201
RTR(config-router)#neighbor 10.0.0.1 remote-as 202
RTR(config-router)#neighbor 10.0.0.5 update-source Ethernet0/0
RTR(config-router)#neighbor 10.0.0.1 update-source Ethernet0/1
RTR(config-router)#ex
RTR(config)#

Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)#neighbor 10.0.0.6 remote-as 200
Piter_RTR1(config-router)#neighbor 10.0.0.6 update-source Ethernet0/2
Piter_RTR1(config-router)#network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)#ex
Piter_RTR1(config)#

Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)#neighbor 10.0.0.2 remote-as 200
Kzn_RTR1(config-router)#neighbor 10.0.0.2 update-source Ethernet0/3
Kzn_RTR1(config-router)#network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)#network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)#ex
Kzn_RTR1(config)#

RTR(config)#interface loopback0
RTR(config-if)#
*Oct 20 06:05:14.748: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
RTR(config-if)#ip address 5.5.5.5 255.255.255.255
RTR(config-if)#ex
RTR(config)#exit
RTR#
*Oct 20 06:05:29.847: %SYS-5-CONFIG_I: Configured from console by console
RTR#clear ip bgp *
RTR#
*Oct 20 06:05:35.328: %BGP-3-NOTIFICATION_MANY: sent to 2 sessions 6/4 (Administrative Reset) for all peers
RTR#show ip bgp summary
BGP router identifier 5.5.5.5, local AS number 200
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.0.0.1        4          202       0       0        1    0    0 never    Idle
10.0.0.5        4          201       0       0        1    0    0 never    Idle

RTR(config)#router bgp 200
RTR(config-router)#neighbor 10.0.0.5 default-originate
RTR(config-router)#neighbor 10.0.0.1 default-originate
RTR(config-router)#ex

![Image](<https://github.com/Ro1FZ/Test-work-Sedinkin/blob/main/%D0%A1%D0%B5%D1%82%D0%B8/Pasted%20image%2020251020224140.png?raw=true>)