![[Pasted image 20251017130101.png]]
![[Pasted image 20251017120441.png]]
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 71
Switch(config-vlan)#name Directors
Switch(config-vlan)#ex
Switch(config)#vlan 77
Switch(config-vlan)#name Zam
Switch(config-vlan)#ex
Switch(config)#vlan 112
Switch(config-vlan)#name Secretary
Switch(config-vlan)#ex
Switch(config)#
*Oct 17 09:03:19.437: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#ex
% Ambiguous command:  "ex"
PiterSW1_ACS(config)#exit
PiterSW1_ACS#wr
*Oct 17 09:04:07.452: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#wr memory
Building configuration...
Compressed configuration from 883 bytes to 583 bytes[OK]
PiterSW1_ACS#
![[Pasted image 20251017121057.png]]
Switch>en
Switch#hostname PiterSW1_Core
        ^
% Invalid input detected at '^' marker.

Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_Core
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Directors
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name Secretary
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name NATIVE
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 17 09:09:50.015: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#wr memory
Building configuration...
Compressed configuration from 884 bytes to 584 bytes[OK]
PiterSW1_Core#
*Oct 17 09:10:08.210: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_Core#
![[Pasted image 20251017122149.png]]
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#namehost PiterSW2_ACS
                ^
% Invalid input detected at '^' marker.

Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Directors
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name Secretary
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr m
*Oct 17 09:20:57.653: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name NATIVE
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr
*Oct 17 09:21:20.561: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#wr memory
Building configuration...
Compressed configuration from 883 bytes to 584 bytes[OK]
PiterSW2_ACS#
![[Pasted image 20251017123001.png]]
![[Pasted image 20251017123840.png]]
![[Pasted image 20251017124259.png]]
![[Pasted image 20251017124706.png]]
PiterSW1_ACS>en
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface e0/2
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 71
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#interface e0/3
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 112
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#wr
*Oct 17 10:04:19.649: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#wr memory
![[Pasted image 20251017130627.png]]
![[Pasted image 20251017131944.png]]
![[Pasted image 20251017131957.png]]
PiterSW2_ACS(config)#interface e0/1
PiterSW2_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW2_ACS(config-if)#switchport mode trunk
PiterSW2_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_ACS(config-if)#switchport trunk native vlan 999
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#
*Oct 17 10:25:23.227: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW2_Core Ethernet0/3 (1).
PiterSW2_ACS(config)#
*Oct 17 10:26:18.600: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW2_Core Ethernet0/3 (1).
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr
*Oct 17 10:26:50.289: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#wr memory
Building configuration...
Compressed configuration from 1194 bytes to 743 bytes[OK]
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface range e0/1
PiterSW1_ACS(config-if-range)#switchport trunk encapsulation dot1q
PiterSW1_ACS(config-if-range)#switchport mode trunk
PiterSW1_ACS(config-if-range)#switchport trunk allowed vlan 71,77,112
PiterSW1_ACS(config-if-range)#switchport trunk native vlan 999
PiterSW1_ACS(config-if-range)#switchport nonegotiate
PiterSW1_ACS(config-if-range)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 17 10:28:49.224: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#
*Oct 17 10:28:51.872: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/1 (999), with PiterSW1_Core Ethernet0/3 (1).
PiterSW1_ACS#wr memory
Building configuration...
Compressed configuration from 1194 bytes to 743 bytes[OK]
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#interface e0/3
PiterSW1_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if)#switchport mode trunk
PiterSW1_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if)#switchport trunk native vlan 999
PiterSW1_Core(config-if)#switchport nonegotiate
PiterSW1_Core(config-if)#exit
PiterSW1_Core(config)#exit
PiterSW1_Core#wr
*Oct 17 10:30:21.596: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#wr memory
Building configuration...
Compressed configuration from 1044 bytes to 683 bytes[OK]
PiterSW2_Core>en
PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#interface e0/3
PiterSW2_Core(config-if)#
*Oct 17 10:31:01.537: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on Ethernet0/3 (1), with PiterSW2_ACS Ethernet0/1 (999).
PiterSW2_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if)#switchport mode trunk
PiterSW2_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if)#switchport trunk native vlan 999
PiterSW2_Core(config-if)#switchport nonegotiate
PiterSW2_Core(config-if)#exit
PiterSW2_Core(config)#exit
PiterSW2_Core#wr
*Oct 17 10:31:31.698: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr memory
Building configuration...
Compressed configuration from 1044 bytes to 683 bytes[OK]
Switch(config)#hostname KznSW1_Core
KznSW1_Core(config)#vlan 4
KznSW1_Core(config-vlan)#
*Oct 17 10:37:29.438: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
KznSW1_Core(config-vlan)#name Engineering
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 71
KznSW1_Core(config-vlan)#name Manager
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 84
KznSW1_Core(config-vlan)#name Leader
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 86
KznSW1_Core(config-vlan)#name Stazer
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 999
KznSW1_Core(config-vlan)#name NATIVE
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#interface e0/0
KznSW1_Core(config-if)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if)#switchport mode trunk
KznSW1_Core(config-if)#
*Oct 17 10:41:40.477: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
KznSW1_Core(config-if)#
*Oct 17 10:41:43.480: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
KznSW1_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if)#switchport trunk native vlan 999
KznSW1_Core(config-if)#switchport nonegotiate
KznSW1_Core(config-if)#ex
KznSW1_Core(config)#exit
KznSW1_Core#wr
*Oct 17 10:42:11.886: %SYS-5-CONFIG_I: Configured from console by console
KznSW1_Core#wr memory
Building configuration...
Compressed configuration from 1043 bytes to 689 bytes[OK]
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname KznSW2_Core
KznSW2_Core(config)#vlan 4
*Oct 17 10:44:22.446: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
KznSW2_Core(config)#vlan 4
KznSW2_Core(config-vlan)#name E
KznSW2_Core(config-vlan)#name Engineering
KznSW2_Core(config-vlan)#ex
KznSW2_Core(config)#vlan 71
KznSW2_Core(config-vlan)#name Manager
KznSW2_Core(config-vlan)#ex
KznSW2_Core(config)#vlan 84
KznSW2_Core(config-vlan)#name Leader
KznSW2_Core(config-vlan)#ex
KznSW2_Core(config)#vlan 86
KznSW2_Core(config-vlan)#name Stazer
KznSW2_Core(config-vlan)#ex
KznSW2_Core(config)#vlan 999
KznSW2_Core(config-vlan)#name NATIVE
KznSW2_Core(config-vlan)#ex
KznSW2_Core(config)#interface e0/0
KznSW2_Core(config-if)#switchport trunk encapsulation dot1q
KznSW2_Core(config-if)#switchport mode trunk
KznSW2_Core(config-if)#
*Oct 17 10:50:42.811: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
KznSW2_Core(config-if)#
*Oct 17 10:50:45.820: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
KznSW2_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW2_Core(config-if)#switchport trunk native vlan 999
KznSW2_Core(config-if)#switchport nonegotiate
KznSW2_Core(config-if)#exit
KznSW2_Core(config)#exit
KznSW2_Core#wr
*Oct 17 10:51:08.363: %SYS-5-CONFIG_I: Configured from console by console
KznSW2_Core#wr memory
Building configuration...
Compressed configuration from 947 bytes to 649 bytes[OK]
Switch3_DSTR>en
Switch3_DSTR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch3_DSTR(config)#interface e0/3
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#interface e0/2
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#exit
Switch3_DSTR(config)#exit
Switch3_DSTR#wr
*Oct 17 10:55:03.170: %SYS-5-CONFIG_I: Configured from console by console
Switch3_DSTR#wr wr memory
                ^
% Invalid input detected at '^' marker.

Switch3_DSTR#wr memory
Building configuration...
Compressed configuration from 1799 bytes to 967 bytes[OK]

PiterSW1_ACS(config)#interface e1/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#exit
PiterSW1_ACS(config)#interface e0/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#exit
PiterSW1_ACS(config)#exit
PiterSW1_ACS#

PiterSW2_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_ACS(config)#interface e0/0
PiterSW2_ACS(config-if)#switchport nonegotiate
Command rejected: Conflict between 'nonegotiate' and 'dynamic' status on this interface: Et0/0
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#interface e1/0
PiterSW2_ACS(config-if)#switchport nonegotiate
Command rejected: Conflict between 'nonegotiate' and 'dynamic' status on this interface: Et1/0
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#wr
*Oct 17 11:08:15.556: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#wr memory
Building configuration...
Compressed configuration from 1290 bytes to 773 bytes[OK]

PiterSW1_Core>en
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#interface range e0/0-2
PiterSW1_Core(config-if-range)#switchport nonegotiate
Command rejected: Conflict between 'nonegotiate' and 'dynamic' status on this interface: Et0/0
% Range command terminated because it failed on Ethernet0/0
PiterSW1_Core(config-if-range)#switchport mode access
PiterSW1_Core(config-if-range)#switchport nonegotiate
PiterSW1_Core(config-if-range)#exit
PiterSW1_Core(config)#exit
PiterSW1_Core#wr
*Oct 17 11:09:29.522: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#wr memory
Building configuration...
Compressed configuration from 1188 bytes to 743 bytes[OK]

PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#interface range e0/0-2
PiterSW2_Core(config-if-range)#switchport mode access
PiterSW2_Core(config-if-range)#switchport nonegotiate
PiterSW2_Core(config-if-range)#ex
PiterSW2_Core(config)#exit
PiterSW2_Core#
*Oct 17 11:12:59.079: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr memory
Building configuration...
Compressed configuration from 1188 bytes to 738 bytes[OK]

PiterSW1_ACS(config)#interface range e1/1-3
PiterSW1_ACS(config-if-range)#shutdown
PiterSW1_ACS(config-if-range)#ex

![[Pasted image 20251017141559.png]]

PiterSW2_ACS(config)#interface range e1/1-3
PiterSW2_ACS(config-if-range)#shutdown
PiterSW2_ACS(config-if-range)#ex

![[Pasted image 20251017141758.png]]

KznSW1_Core(config)#interface e0/3
KznSW1_Core(config-if)#shutdown
KznSW1_Core(config-if)#ex

![[Pasted image 20251017142337.png]]

KznSW2_Core(config)#interface e0/3
KznSW2_Core(config-if)#shutdown
KznSW2_Core(config-if)#ex

![[Pasted image 20251017142508.png]]
