![[Pasted image 20251018193314.png]]
Вот схема для лр4
Cтатическая маршрутизация (Питер)
```
Router(config)#hostname Piter_RTR1
Piter_RTR1(config)#int e0/0
Piter_RTR1(config-if)#ip address 172.18.71.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#
*Oct 18 17:40:52.549: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 18 17:40:53.556: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, cha                                                                                                                        nged state to up
Piter_RTR1(config)#int e0/1
Piter_RTR1(config-if)#ip address 172.18.112.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#
*Oct 18 17:41:19.203: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 18 17:41:20.209: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, cha                                                                                                                        nged state to up
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
Piter_RTR1#ping 172.18.112.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.10, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
Piter_RTR1#ping 172.18.112.11
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/13/18 ms
Piter_RTR1#ping 172.18.77.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.77.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 11/14/16 ms
Piter_RTR1#ping 172.18.71.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.71.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 14/15/16 ms

```
![[Pasted image 20251019140810.png]]

Switch>EN
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW_VIP
SW_VIP(config)#vlan 777
SW_VIP(config-vlan)#name VIP_VLAN
SW_VIP(config-vlan)#ex
SW_VIP(config)#int e0/1
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#ex
SW_VIP(config)#int e0/0
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#exit
SW_VIP(config)#interface range ethernet0/2-3
SW_VIP(config-if-range)#shutdown
SW_VIP(config-if-range)#
*Oct 19 11:21:01.296: %LINK-5-CHANGED: Interface Ethernet0/2, changed state to administratively down
*Oct 19 11:21:01.326: %LINK-5-CHANGED: Interface Ethernet0/3, changed state to administratively down
*Oct 19 11:21:02.302: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
*Oct 19 11:21:02.333: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
SW_VIP(config-if-range)#exit
