![[Pasted image 20251018193314.png]]
Вот схема для лр4
Cтатическая маршрутизация (Питер)
```
Router(config)#hostname Piter_RTR1
Piter_RTR1(config)#int e0/0
Piter_RTR1(config-if)#ip address 172.18.71.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#
*Oct 18 17:40:52.549: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 18 17:40:53.556: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, cha                                                                                                                        nged state to up
Piter_RTR1(config)#int e0/1
Piter_RTR1(config-if)#ip address 172.18.112.1 255.255.255.240
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#
*Oct 18 17:41:19.203: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 18 17:41:20.209: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, cha                                                                                                                        nged state to up
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
Piter_RTR1#ping 172.18.112.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.10, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
Piter_RTR1#ping 172.18.112.11
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.112.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/13/18 ms
Piter_RTR1#ping 172.18.77.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.77.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 11/14/16 ms
Piter_RTR1#ping 172.18.71.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.18.71.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 14/15/16 ms

```
![[Pasted image 20251019140810.png]]

Switch>EN
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW_VIP
SW_VIP(config)#vlan 777
SW_VIP(config-vlan)#name VIP_VLAN
SW_VIP(config-vlan)#ex
SW_VIP(config)#int e0/1
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#ex
SW_VIP(config)#int e0/0
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#no shutdown
SW_VIP(config-if)#exit
SW_VIP(config)#interface range ethernet0/2-3
SW_VIP(config-if-range)#shutdown
SW_VIP(config-if-range)#
*Oct 19 11:21:01.296: %LINK-5-CHANGED: Interface Ethernet0/2, changed state to administratively down
*Oct 19 11:21:01.326: %LINK-5-CHANGED: Interface Ethernet0/3, changed state to administratively down
*Oct 19 11:21:02.302: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
*Oct 19 11:21:02.333: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
SW_VIP(config-if-range)#exit

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname Kzn_RTR2
Kzn_RTR2(config)#int e0/1
Kzn_RTR2(config-if)#
*Oct 19 11:23:32.108: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Kzn_RTR2(config-if)#no switchport
                        ^
% Invalid input detected at '^' marker.

Kzn_RTR2(config-if)#ip address 10.10.77.1 255.255.255.0
Kzn_RTR2(config-if)#no shutdown
Kzn_RTR2(config-if)#ex
Kzn_RTR2(config)#
*Oct 19 11:24:00.277: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
Kzn_RTR2(config)#
*Oct 19 11:24:01.298: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
Kzn_RTR2(config)#end
Kzn_RTR2#
*Oct 19 11:24:13.425: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR2#wr memory
Building configuration...
[OK]
![[Pasted image 20251019142547.png]]

```
outer(config)#hostname Kzn_RTR1
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)# router-id 1.1.1.1
Kzn_RTR1(config-router)# network 0.0.0.0 255.255.255.255 area 0
Kzn_RTR1(config-router)# exit
Kzn_RTR1(config)#int range e0/0-1
Kzn_RTR1(config-if-range)#ip ospf priority 255
Kzn_RTR1(config-if-range)# ip ospf network broadcast
Kzn_RTR1(config-if-range)# exit
Kzn_RTR1(config)#end
*Oct 19 11:28:00.954: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR1#wr memory
Building configuration...
[OK]

```
Kzn_RTR2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR2(config)#router ospf 1
Kzn_RTR2(config-router)#router-id 2.2.2.2
Kzn_RTR2(config-router)#network 0.0.0.0 255.255.255.255 area 0
Kzn_RTR2(config-router)#ex
Kzn_RTR2(config)#int range e0/0-1
Kzn_RTR2(config-if-range)#ip ospf priority 0
Kzn_RTR2(config-if-range)#ip ospf network broadcast
Kzn_RTR2(config-if-range)#ex
Kzn_RTR2(config)#end
Kzn_RTR2#wr
*Oct 19 11:30:38.501: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR2#wr memory
Building configuration...
[OK]
Kzn_RTR2#


Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#interface ethernet0/1
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#interface e0/0
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#end
Kzn_RTR1#
*Oct 19 11:36:50.495: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR1#wr memory
Building configuration...
[OK]

Kzn_RTR2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR2(config)#interface ethernet0/0
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ex
Kzn_RTR2(config)#interface ethernet0/1
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ex
Kzn_RTR2(config)#end
Kzn_RTR2#
*Oct 19 11:38:01.170: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR2#wr memory
Building configuration...
[OK]
 у меня вылезали ошибки в  KznSW1-2 core и я принял решения их пересоздать
 ```
KznSW1_Core(config)#interface ethernet0/3
KznSW1_Core(config-if)# no switchport
KznSW1_Core(config-if)# ip address 10.0.1.2 255.255.255.252
KznSW1_Core(config-if)# no shutdown
KznSW1_Core(config-if)# exit
KznSW1_Core(config)#router ospf 1
KznSW1_Core(config-router)# router-id 3.3.3.3
KznSW1_Core(config-router)# network 0.0.0.0 255.255.255.255 area 0
KznSW1_Core(config-router)# exit
KznSW1_Core(config)#interface ethernet0/3
KznSW1_Core(config-if)# ip ospf 1 area 0
KznSW1_Core(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/3: Key 1 already exists
KznSW1_Core(config-if)# ip ospf authentication message-digest
KznSW1_Core(config-if)# ip ospf priority 50
KznSW1_Core(config-if)# ip ospf network point-to-point
KznSW1_Core(config-if)# exit
KznSW1_Core(config)#end
```
 Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)#router-id 4.4.4.4
Kzn_RTR1(config-router)#network 10.10.4.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.71.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.84.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.86.0 0.0.0.127 area 0
Kzn_RTR1(config-router)#network 10.10.77.0 0.0.0.255 area 0
Kzn_RTR1(config-router)#network 10.10.84.16 0.0.0.15 area 0
Kzn_RTR1(config-router)#ex
Kzn_RTR1(config)#interface Ethernet0/0
Kzn_RTR1(config-if)#ip ospf priority 255
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/0: Key 1 already exists
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#interface Ethernet0/1
Kzn_RTR1(config-if)#ip ospf priority 255
Kzn_RTR1(config-if)#ip ospf authentication message-digest
Kzn_RTR1(config-if)#ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/1: Key 1 already exists
Kzn_RTR1(config-if)#ex
Kzn_RTR1(config)#end
Kzn_RTR1#
*Oct 19 12:13:32.537: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR1#wr memory
Building configuration...
[OK]

Kzn_RTR2>en
Kzn_RTR2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR2(config)#router ospf 1
Kzn_RTR2(config-router)#router-id 5.5.5.5
Kzn_RTR2(config-router)#network 10.10.4.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.71.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.84.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.86.0 0.0.0.127 area 0
Kzn_RTR2(config-router)#network 10.10.77.0 0.0.0.255 area 0
Kzn_RTR2(config-router)#network 10.10.84.16 0.0.0.15 area 0
Kzn_RTR2(config-router)#ex
Kzn_RTR2(config)#interface Ethernet0/0
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/0: Key 1 already exists
Kzn_RTR2(config-if)#ex
Kzn_RTR2(config)#interface Ethernet0/1
Kzn_RTR2(config-if)#ip ospf authentication message-digest
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/1: Key 1 already exists
Kzn_RTR2(config-if)#ex
![[Pasted image 20251019235041.png]]




![[Pasted image 20251019224543.png]]